<?php
namespace App\Module\Sale\Data;

use Swork\Bean\BeanCollector;

/**
 * 电商采购字典
 * Class PurData
 * @package App\Module\Sale\Data
 */
class PurDictData extends BeanCollector
{
    /**
     * 小程序签名秘钥
     */
    const API_SECRET = 'xZVrdQniL0pH5I7m8etckbB3azCFs2hT';

    /**
     * 指定退货出库人（确认退货创建出库单使用）
     */
    const STC_RTN_USER = '596bf69c1f991d17b5000003';

    /**
     * 电商采购平台
     */
    const PUR_PLAT = 24;

    /**
     * 商品指定电商使用（电商采购入库后 / 其他渠道添加库存）
     */
    const PUR_INWAY1 = 51;

    /**
     * 商品转自有销售
     */
    const PUR_INWAY2 = 52;

    /**
     * 需求状态
     */
    const PUR_DEMAND_STAT = [
        1 => '待审核',
        2 => '待开始',
        3 => '采购中',
        4 => '已驳回',
        5 => '已完成',
        6 => '已中止',
        7 => '已取消',
    ];

    /**
     * 采购计划类型
     */
    const PUR_PLAN_TYPE = [
        1 => '定期采购',
        2 => '紧急采购',
    ];

    /**
     * 采购单状态
     */
    const PUR_ORDER_OSTAT = [
        1 => '进行中',
        2 => '已完成',
        3 => '已中止',
    ];

    /**
     *
     * 需求状态
     */
    const PUR_ODR_GOODS = [
        1 => '预入库',
        2 => '已入库',
        3 => '已质检',
        4 => '已完成',
        5 => '确认退货',
    ];
    /**
     * 计划单状态
     */
    const PUR_PSTAT = [
        0 => '全部',
        1 => '待审核',
        2 => '待开始',
        3 => '采购中',
        4 => '已驳回',
        5 => '已完成',
        6 => '已关闭',
        7 => '已取消'
    ];

    /**
     * 需求单状态
     */
    const PUR_DSTAT = [
        1 => '待审核',
        2 => '待开始',
        3 => '采购中',
        4 => '已驳回',
        5 => '已完成',
        6 => '已关闭',
        7 => '已取消'
    ];

    /**
     * 电商采购计划是否逾期
     */
    const PUR_DELAY = [
        1 => '否',
        2 => '是'
    ];

    /**
     * 电商采购计划时间类型
     */
    const PUR_TIMR = [
        1 => '创建时间',
        2 => '审核时间',
        3 => '取消时间',
        4 => '驳回时间',
        5 => '完成时间',
        6 => '中止时间'
    ];

    /**
     * 电商采购计划时间类型
     */
    const PUR_PDR_STAT = [
        1 => '待审核',
        2 => '已通过',
        3 => '已驳回',
    ];

    /**
     * 采购单审核状态
     */
    const PUR_CSTAT = [
        1 => '待审核',
        2 => '部分通过',
        3 => '全部通过',
        4 => '全部拒绝',
    ];

    /**
     * 退货单号状态类型
     */
    const PUR_RTN_STAT = [
        0 => '全部',
        1 => '待退货',
        2 => '已退货',
    ];

    /**
     * 采购单状态
     */
    const PUR_ODR_ORDER = [
        1 => '待审核',
        2 => '部分通过',
        3 => '全部通过',
        4 => '全部拒绝'
    ];

    /**
     * 采购单需求任务状态
     */
    const TASK_TSTAT = [
        1 => '待采购',
        2 => '采购中',
        3 => '已完成',
        4 => '已中止'
    ];

    /**
     * 采购单审核状态
     */
    const PUR_ODR_DEMAND = [
        1 => '待审核',
        2 => '已通过',
        3 => '已驳回',
    ];

    /**
     * 采购单审核状态
     */
    const PUR_ODR_DEMEND = [
        1 => '待审核',
        2 => '已通过',
        3 => '已驳回'
    ];

    /**
     * 采购计划审核状态
     */
    const PUR_PLAN_CSTAT = [
        1 => '待审核',
        2 => '已通过',
        3 => '已驳回'
    ];

    /**
     * 公司自有供应商（非自有不可转电商库）
     */
    const SELF_OFFER = [
        '5af2b1a61f991d169200005c',//彩果
        '5e7457dd5d9b1570383248d5',//童亮
        '5e688c825d9b15021e56f667',//林浩勉
        '5e8c50095d9b15679432076d',//采卓
        '5fe93a145d9b152b3a2e498d',//华洋

        //测试供应商
        '5cb55c485d9b1557db6102af',
        '5d1035525d9b152bdf700572',
        '5d521d0342e36b56f03f374d',
        '5d53f3628dacd04f862da333',
    ];
}